import re
# yidong = [134,135,136,137,138,139,147,150,151,152,157,158,159,178,182,183,184,187,188,198]
# liantong = [130,131,132,155,156,145,176,185,186,166]
# dianxing = [133,149,153,173,177,180,181,189,199]
while True:
    a = input('请输入手机号：')
    if len(a) != 11:
        print('不是手机号')
        break
    b = re.findall('\D',a)
    if len(b) != 0:
        print('只能是数字')
        break
    list1 = re.findall('^134|^135|^136|^137|^138|^139|^147|^150|^151|^152|'
                       '^157|^158|^159|^178|^182|^183|^184|^187|^188|^198', a)
    list2 = re.findall('^130|^131|^132|^155|^156|^145|^176|^185|^186|^166',a)
    list3 = re.findall('^133|^149|^153|^173|^177|^180|^181|^189|^199',a)
    if len(list1) != 0:
        print('该号码为移动')
        break
    elif len(list2) != 0:
        print('该号码为联通')
        break
    elif len(list3) != 0:
        print('该号码为电信')
        break
    else:
        print('什么都不是')
        break

